### Filter
    o	It implements conditions each and every elements of iterable and return only satisfied elements.
    o	Syntax:
        	filter(func,<Iterable>)
        	filter(lambda(),<Iterable>)
    o	No. of output element either equal or less than the input number based on the condition.

### Reduce
    o	It is used to reduce the final output to a single output.
    o	It is a part of “functools” library

### Map() with Lambda

In [2]:
nlist=[9,5,8,7,4,6]
nlist

[9, 5, 8, 7, 4, 6]

In [3]:
res=list(map(lambda x:x**2 ,   nlist))
res

[81, 25, 64, 49, 16, 36]

In [4]:
res1=list(map(lambda x:x**2 ,   [9,5,8,7,4,6]))
res1

[81, 25, 64, 49, 16, 36]

In [5]:
print(list(map(lambda x:x**2 ,   [9,5,8,7,4,6])))

[81, 25, 64, 49, 16, 36]

In [8]:
clist=["INDIA","USA","FRANCE","UK","JAPAN","UAE"]

In [9]:
list(map(lambda x:len(x)  , clist))

[5, 3, 6, 2, 5, 3]

In [10]:
list(map(lambda x:len(x)>3  , clist))

[True, False, True, False, True, False]

### Filter()

In [11]:
clist=["INDIA","USA","FRANCE","UK","JAPAN","UAE"]

list(filter(lambda x:len(x)>3  , clist))

['INDIA', 'FRANCE', 'JAPAN']

In [14]:
import numpy as np

In [16]:
arr=np.random.randint(50,150,(40))
arr

array([ 50,  62,  59,  84, 102,  85,  59, 117,  86,  76,  86,  57,  70,
        61,  88,  60,  57,  59, 149, 120,  79,  64, 127,  58,  78, 110,
        59, 140,  52,  96, 144,  95, 145,  53,  79,  88,  78,  92, 125,
       107])

In [17]:
arr.size

40

In [20]:
list(filter(lambda x:x, arr))

[50,
 62,
 59,
 84,
 102,
 85,
 59,
 117,
 86,
 76,
 86,
 57,
 70,
 61,
 88,
 60,
 57,
 59,
 149,
 120,
 79,
 64,
 127,
 58,
 78,
 110,
 59,
 140,
 52,
 96,
 144,
 95,
 145,
 53,
 79,
 88,
 78,
 92,
 125,
 107]

In [18]:
list(filter(lambda x:x>=100, arr))

[102, 117, 149, 120, 127, 110, 140, 144, 145, 125, 107]

In [19]:
list(filter(lambda x:x<=100, arr))

[50,
 62,
 59,
 84,
 85,
 59,
 86,
 76,
 86,
 57,
 70,
 61,
 88,
 60,
 57,
 59,
 79,
 64,
 58,
 78,
 59,
 52,
 96,
 95,
 53,
 79,
 88,
 78,
 92]

In [21]:
list(filter(lambda x:x%3==0, arr))

[84, 102, 117, 57, 60, 57, 120, 78, 96, 144, 78]

In [23]:
str="Good Morning Everyone. Welcome to Lambda Class"

In [24]:
v=["a","e","i","o","u"]

In [25]:
a=list(str)
a

['G',
 'o',
 'o',
 'd',
 ' ',
 'M',
 'o',
 'r',
 'n',
 'i',
 'n',
 'g',
 ' ',
 'E',
 'v',
 'e',
 'r',
 'y',
 'o',
 'n',
 'e',
 '.',
 ' ',
 'W',
 'e',
 'l',
 'c',
 'o',
 'm',
 'e',
 ' ',
 't',
 'o',
 ' ',
 'L',
 'a',
 'm',
 'b',
 'd',
 'a',
 ' ',
 'C',
 'l',
 'a',
 's',
 's']

In [27]:
list(filter(lambda s:s in v ,a))

['o', 'o', 'o', 'i', 'e', 'o', 'e', 'e', 'o', 'e', 'o', 'a', 'a', 'a']

In [28]:
set(list(filter(lambda s:s in v ,a)))

{'a', 'e', 'i', 'o'}

### Reduce()

In [29]:
from functools import reduce

In [30]:
nlist

[9, 5, 8, 7, 4, 6]

In [31]:
reduce(lambda x,y:x+y ,  nlist)

39

In [32]:
reduce(lambda x,y:x*y ,  nlist)

60480

In [33]:
n1=[9, 5,18, 8, 7, 4, 6]
reduce(lambda x,y: x  if x>y else y ,  n1)

18

In [34]:
n1=[9, 5,18, 8, 7, 4, 6]
reduce(lambda x,y: x  if x<y else y ,  n1)

4

### Implementing Map with Lambda on Data Frame

In [35]:
std={
    "Name":["A","B","C","D"],
    "English":[60,80,85,65],
    "Science":[78,59,79,90]
    
}

In [36]:
std

{'Name': ['A', 'B', 'C', 'D'],
 'English': [60, 80, 85, 65],
 'Science': [78, 59, 79, 90]}

In [37]:
import pandas as pd

In [38]:
s=pd.DataFrame(std)

In [39]:
s

  Name  English  Science
0    A       60       78
1    B       80       59
2    C       85       79
3    D       65       90

In [40]:
s["Computer"]=[69,89,76,95]
s

  Name  English  Science  Computer
0    A       60       78        69
1    B       80       59        89
2    C       85       79        76
3    D       65       90        95

In [41]:
s["Math"]=[40,58,79]
s

ValueError: Length of values (3) does not match length of index (4)

In [42]:
s["History"]=80
s

  Name  English  Science  Computer  History
0    A       60       78        69       80
1    B       80       59        89       80
2    C       85       79        76       80
3    D       65       90        95       80

In [43]:
del s["History"]

In [44]:
s

  Name  English  Science  Computer
0    A       60       78        69
1    B       80       59        89
2    C       85       79        76
3    D       65       90        95

In [46]:
s["Total"]=s["English"]+s["Science"]+s["Computer"]

In [47]:
s

  Name  English  Science  Computer  Total
0    A       60       78        69    207
1    B       80       59        89    228
2    C       85       79        76    240
3    D       65       90        95    250

In [48]:
s["Average"]=s["Total"]/3

In [49]:
s

  Name  English  Science  Computer  Total    Average
0    A       60       78        69    207  69.000000
1    B       80       59        89    228  76.000000
2    C       85       79        76    240  80.000000
3    D       65       90        95    250  83.333333

In [52]:
import numpy as np
np.round(69.000000)

69.0

In [53]:
np.round(s["Average"],2)

0    69.00
1    76.00
2    80.00
3    83.33
Name: Average, dtype: float64

In [54]:
s["Average"]=np.round(s["Average"],2)

In [55]:
s

  Name  English  Science  Computer  Total  Average
0    A       60       78        69    207    69.00
1    B       80       59        89    228    76.00
2    C       85       79        76    240    80.00
3    D       65       90        95    250    83.33

In [56]:
s["Average"]

0    69.00
1    76.00
2    80.00
3    83.33
Name: Average, dtype: float64

In [59]:
s["Grade"]=s["Average"].map(lambda x: "Grade A" if x>=80 else( "Grade B"  if x>=70 else "Grade C"))
s["Grade"]

0    Grade C
1    Grade B
2    Grade A
3    Grade A
Name: Grade, dtype: object

In [60]:
s

  Name  English  Science  Computer  Total  Average    Grade
0    A       60       78        69    207    69.00  Grade C
1    B       80       59        89    228    76.00  Grade B
2    C       85       79        76    240    80.00  Grade A
3    D       65       90        95    250    83.33  Grade A

In [61]:
s["Average"].apply((lambda x: "Grade A" if x>=80 else( "Grade B"  if x>=70 else "Grade C")))

0    Grade C
1    Grade B
2    Grade A
3    Grade A
Name: Average, dtype: object